{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Embedding", "config": {"mask_zero": false, "name": "embedding_12", "embeddings_constraint": null, "input_dim": 6798, "batch_input_shape": [null, null], "output_dim": 50, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "dtype": "float32", "trainable": false, "activity_regularizer": null, "input_length": null}}, {"class_name": "Conv1D", "config": {"kernel_size": [5], "data_format": "channels_last", "padding": "valid", "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "strides": [1], "trainable": true, "kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_max_pooling1d_8"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "seed": null, "name": "dropout_15"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "name": "dense_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "units": 128, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "seed": null, "name": "dropout_16"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "name": "dense_16", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "units": 18, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax"}}], "name": "sequential_12"}, "backend": "tensorflow"}