{"keras_version": "2.2.4", "config": {"name": "sequential_9", "layers": [{"config": {"mask_zero": false, "input_dim": 18931, "embeddings_regularizer": null, "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "name": "embedding_9", "activity_regularizer": null, "input_length": null, "output_dim": 200}, "class_name": "Embedding"}, {"config": {"kernel_constraint": null, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "name": "conv1d_10", "activation": "linear", "kernel_size": [5], "strides": [1], "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"padding": "same", "name": "max_pooling1d_6", "trainable": true, "data_format": "channels_last", "strides": [1], "pool_size": [3]}, "class_name": "MaxPooling1D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "name": "conv1d_11", "activation": "linear", "kernel_size": [4], "strides": [1], "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"padding": "same", "name": "max_pooling1d_7", "trainable": true, "data_format": "channels_last", "strides": [1], "pool_size": [4]}, "class_name": "MaxPooling1D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "name": "conv1d_12", "activation": "linear", "kernel_size": [3], "strides": [1], "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"padding": "same", "name": "max_pooling1d_8", "trainable": true, "data_format": "channels_last", "strides": [1], "pool_size": [5]}, "class_name": "MaxPooling1D"}, {"config": {"name": "time_distributed_7", "layer": {"config": {"kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 20, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_13", "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 1, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_14", "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}